20260824/20260824/Documents/ПланПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПланПроизводства</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОбновитьДополнить</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПользовательскиеНастройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Продукция</Name>
				</Properties>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПравилоЗаполнения</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

20260824/20260824/Enums/ЕдиницыИзмеренияВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЕдиницыИзмеренияВремени</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Час</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Минута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Секунда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сутки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

20260824/20260824/Documents/ПланПроизводства/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура СБ_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.ВидПлана = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справочники.СБ_Предопределенные.ПланОтгрузокНаСкладСбыта, "Значение") Тогда
		УведомитьОНехваткеВремениНаПроизводство(Объект, ТекущийОбъект);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УведомитьОНехваткеВремениНаПроизводство(Объект, ТекущийОбъект) 
	УстановитьПривилегированныйРежим(Истина);
	
	ПустаяСсылка = Объект.Ссылка.Пустая();
	
	Если ПустаяСсылка Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Продукция.Номенклатура КАК Номенклатура,
		|	Продукция.Характеристика КАК Характеристика,
		|	Продукция.КоличествоУпаковок КАК КоличествоУпаковок,
		|	Продукция.ДатаВыпуска КАК ДатаВыпуска,
		|	Продукция.Спецификация КАК Спецификация
		|ПОМЕСТИТЬ ВТ_НоменклатураПланаПроизводства
		|ИЗ
		|	&Продукция КАК Продукция
		|ГДЕ
		|	Продукция.Отменено = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РесурсныеСпецификацииВыходныеИзделия.Номенклатура КАК Номенклатура,
		|	РесурсныеСпецификацииВыходныеИзделия.Характеристика КАК Характеристика,
		|	РесурсныеСпецификацииВыходныеИзделия.КоличествоУпаковок КАК КоличествоУпаковок,
		|	РесурсныеСпецификацииВыходныеИзделия.Этап КАК Этап,
		|	РесурсныеСпецификацииВыходныеИзделия.Этап.ДлительностьЭтапа КАК ЭтапДлительностьЭтапа,
		|	РесурсныеСпецификацииВыходныеИзделия.Этап.ЕдиницаИзмеренияДлительностиЭтапа КАК ЭтапЕдиницаИзмеренияДлительностиЭтапа,
		|	РесурсныеСпецификацииВыходныеИзделия.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Спецификации
		|ИЗ
		|	Справочник.РесурсныеСпецификации.ВыходныеИзделия КАК РесурсныеСпецификацииВыходныеИзделия
		|ГДЕ
		|	(РесурсныеСпецификацииВыходныеИзделия.ВидНоменклатуры В ИЕРАРХИИ (&ГотоваяПродукция)
		|			ИЛИ РесурсныеСпецификацииВыходныеИзделия.ВидНоменклатуры В ИЕРАРХИИ (&ИзделияПоКооперации))
		|	И РесурсныеСпецификацииВыходныеИзделия.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_НоменклатураПланаПроизводства.Спецификация
		|			ИЗ
		|				ВТ_НоменклатураПланаПроизводства)
		|	И РесурсныеСпецификацииВыходныеИзделия.НомерСтроки = 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НоменклатураПланаПроизводства.Номенклатура КАК Номенклатура,
		|	ВТ_НоменклатураПланаПроизводства.Характеристика КАК Характеристика,
		|	ВТ_НоменклатураПланаПроизводства.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ВТ_НоменклатураПланаПроизводства.ДатаВыпуска КАК ДатаВыпуска,
		|	ВТ_НоменклатураПланаПроизводства.Спецификация КАК Спецификация,
		|	ВТ_Спецификации.КоличествоУпаковок КАК КоличествоУпаковокСпецификации,
		|	ВТ_Спецификации.ЭтапДлительностьЭтапа КАК ЭтапДлительностьЭтапа,
		|	ВТ_Спецификации.ЭтапЕдиницаИзмеренияДлительностиЭтапа КАК ЭтапЕдиницаИзмеренияДлительностиЭтапа
		|ИЗ
		|	ВТ_НоменклатураПланаПроизводства КАК ВТ_НоменклатураПланаПроизводства
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Спецификации КАК ВТ_Спецификации
		|		ПО ВТ_НоменклатураПланаПроизводства.Номенклатура = ВТ_Спецификации.Номенклатура
		|			И ВТ_НоменклатураПланаПроизводства.Характеристика = ВТ_Спецификации.Характеристика
		|			И ВТ_НоменклатураПланаПроизводства.Спецификация = ВТ_Спецификации.Ссылка";
	
		Запрос.УстановитьПараметр("Продукция", ТекущийОбъект.Продукция.Выгрузить());
		Запрос.УстановитьПараметр("ГотоваяПродукция", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справочники.СБ_Предопределенные.ГотоваяПродукция, "Значение").Родитель);
		Запрос.УстановитьПараметр("ИзделияПоКооперации", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справочники.СБ_Предопределенные.ИзделияПоКооперации, "Значение").Родитель);
		
		РезультатЗапроса = Запрос.Выполнить();
	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ДатаОтсечения = ТекущаяДатаСеанса();
		ШаблонОшибки = НСтр("ru = 'Сдача продукции %1 в количестве %2 по планам производства задержится на количество дней: %3'");
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			КратностьКоличестваУпаковок = ВыборкаДетальныеЗаписи.КоличествоУпаковок / ВыборкаДетальныеЗаписи.КоличествоУпаковокСпецификации;
			ДлительностьСпецификацииСКратностьюВСекундах = (ОбщегоНазначенияУТКлиентСервер.ВремяВСекундах(ВыборкаДетальныеЗаписи.ЭтапДлительностьЭтапа, ВыборкаДетальныеЗаписи.ЭтапЕдиницаИзмеренияДлительностиЭтапа) * КратностьКоличестваУпаковок);
			РасчетноеВремяЗавершенияЭтапа = ОбщегоНазначенияУТКлиентСервер.ДобавитьКДатеВремя(ДатаОтсечения, ДлительностьСпецификацииСКратностьюВСекундах, Перечисления.ЕдиницыИзмеренияВремени.Секунда);
			РазностьДат = Цел(((РасчетноеВремяЗавершенияЭтапа + 86400) - ВыборкаДетальныеЗаписи.ДатаВыпуска)/86400);
			Если РазностьДат > 0 Тогда
				ТекстОшибки = СтрШаблон(ШаблонОшибки, ВыборкаДетальныеЗаписи.Номенклатура, ВыборкаДетальныеЗаписи.КоличествоУпаковок, РазностьДат);
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			КонецЕсли;
			
		КонецЦикла;
	
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоваяПродукция.Номенклатура КАК Номенклатура,
		|	НоваяПродукция.Характеристика КАК Характеристика,
		|	НоваяПродукция.КоличествоУпаковок КАК КоличествоУпаковок,
		|	НоваяПродукция.ДатаВыпуска КАК ДатаВыпуска,
		|	НоваяПродукция.Спецификация КАК Спецификация
		|ПОМЕСТИТЬ ВТ_НоваяПродукция
		|ИЗ
		|	&НоваяПродукция КАК НоваяПродукция
		|ГДЕ
		|	НоваяПродукция.Отменено = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтараяПродукция.Номенклатура КАК Номенклатура,
		|	СтараяПродукция.Характеристика КАК Характеристика,
		|	СтараяПродукция.КоличествоУпаковок КАК КоличествоУпаковок,
		|	СтараяПродукция.ДатаВыпуска КАК ДатаВыпуска,
		|	СтараяПродукция.Спецификация КАК Спецификация
		|ПОМЕСТИТЬ ВТ_СтараяПродукция
		|ИЗ
		|	&СтараяПродукция КАК СтараяПродукция
		|ГДЕ
		|	СтараяПродукция.Отменено = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НоваяПродукция.Номенклатура КАК Номенклатура,
		|	ВТ_НоваяПродукция.Характеристика КАК Характеристика,
		|	ВТ_НоваяПродукция.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ВТ_НоваяПродукция.ДатаВыпуска КАК ДатаВыпуска,
		|	ВТ_НоваяПродукция.Спецификация КАК Спецификация,
		|	ВТ_СтараяПродукция.Номенклатура КАК НоменклатураСтарая
		|ПОМЕСТИТЬ ВТ_НоменклатураПланаПроизводства
		|ИЗ
		|	ВТ_НоваяПродукция КАК ВТ_НоваяПродукция
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СтараяПродукция КАК ВТ_СтараяПродукция
		|		ПО ВТ_НоваяПродукция.Номенклатура = ВТ_СтараяПродукция.Номенклатура
		|			И ВТ_НоваяПродукция.Характеристика = ВТ_СтараяПродукция.Характеристика
		|			И ВТ_НоваяПродукция.КоличествоУпаковок = ВТ_СтараяПродукция.КоличествоУпаковок
		|			И ВТ_НоваяПродукция.ДатаВыпуска = ВТ_СтараяПродукция.ДатаВыпуска
		|			И ВТ_НоваяПродукция.Спецификация = ВТ_СтараяПродукция.Спецификация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НоменклатураПланаПроизводства.Номенклатура КАК Номенклатура,
		|	ВТ_НоменклатураПланаПроизводства.Характеристика КАК Характеристика,
		|	ВТ_НоменклатураПланаПроизводства.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ВТ_НоменклатураПланаПроизводства.ДатаВыпуска КАК ДатаВыпуска,
		|	ВТ_НоменклатураПланаПроизводства.Спецификация КАК Спецификация
		|ПОМЕСТИТЬ ВТ_НомеклатураИтоговая
		|ИЗ
		|	ВТ_НоменклатураПланаПроизводства КАК ВТ_НоменклатураПланаПроизводства
		|ГДЕ
		|	ВТ_НоменклатураПланаПроизводства.НоменклатураСтарая ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РесурсныеСпецификацииВыходныеИзделия.Номенклатура КАК Номенклатура,
		|	РесурсныеСпецификацииВыходныеИзделия.Характеристика КАК Характеристика,
		|	РесурсныеСпецификацииВыходныеИзделия.КоличествоУпаковок КАК КоличествоУпаковок,
		|	РесурсныеСпецификацииВыходныеИзделия.Этап КАК Этап,
		|	РесурсныеСпецификацииВыходныеИзделия.Этап.ДлительностьЭтапа КАК ЭтапДлительностьЭтапа,
		|	РесурсныеСпецификацииВыходныеИзделия.Этап.ЕдиницаИзмеренияДлительностиЭтапа КАК ЭтапЕдиницаИзмеренияДлительностиЭтапа,
		|	РесурсныеСпецификацииВыходныеИзделия.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Спецификации
		|ИЗ
		|	Справочник.РесурсныеСпецификации.ВыходныеИзделия КАК РесурсныеСпецификацииВыходныеИзделия
		|ГДЕ
		|	(РесурсныеСпецификацииВыходныеИзделия.ВидНоменклатуры В ИЕРАРХИИ (&ГотоваяПродукция)
		|			ИЛИ РесурсныеСпецификацииВыходныеИзделия.ВидНоменклатуры В ИЕРАРХИИ (&ИзделияПоКооперации))
		|	И РесурсныеСпецификацииВыходныеИзделия.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_НомеклатураИтоговая.Спецификация
		|			ИЗ
		|				ВТ_НомеклатураИтоговая)
		|	И РесурсныеСпецификацииВыходныеИзделия.НомерСтроки = 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НомеклатураИтоговая.Номенклатура КАК Номенклатура,
		|	ВТ_НомеклатураИтоговая.Характеристика КАК Характеристика,
		|	ВТ_НомеклатураИтоговая.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ВТ_НомеклатураИтоговая.ДатаВыпуска КАК ДатаВыпуска,
		|	ВТ_НомеклатураИтоговая.Спецификация КАК Спецификация,
		|	ВТ_Спецификации.КоличествоУпаковок КАК КоличествоУпаковокСпецификации,
		|	ВТ_Спецификации.ЭтапДлительностьЭтапа КАК ЭтапДлительностьЭтапа,
		|	ВТ_Спецификации.ЭтапЕдиницаИзмеренияДлительностиЭтапа КАК ЭтапЕдиницаИзмеренияДлительностиЭтапа
		|ИЗ
		|	ВТ_НомеклатураИтоговая КАК ВТ_НомеклатураИтоговая
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Спецификации КАК ВТ_Спецификации
		|		ПО ВТ_НомеклатураИтоговая.Номенклатура = ВТ_Спецификации.Номенклатура
		|			И ВТ_НомеклатураИтоговая.Характеристика = ВТ_Спецификации.Характеристика
		|			И ВТ_НомеклатураИтоговая.Спецификация = ВТ_Спецификации.Ссылка";
	
		Запрос.УстановитьПараметр("НоваяПродукция", Объект.Продукция.Выгрузить());
		Запрос.УстановитьПараметр("СтараяПродукция", Объект.Ссылка.Продукция.Выгрузить());
		Запрос.УстановитьПараметр("ГотоваяПродукция", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справочники.СБ_Предопределенные.ГотоваяПродукция, "Значение").Родитель);
		Запрос.УстановитьПараметр("ИзделияПоКооперации", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справочники.СБ_Предопределенные.ИзделияПоКооперации, "Значение").Родитель);
		
		РезультатЗапроса = Запрос.Выполнить();
	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ДатаОтсечения = ТекущаяДатаСеанса();
		ШаблонОшибки = НСтр("ru = 'Сдача продукции %1 в количестве %2 по планам производства задержится на количество дней: %3'");
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			КратностьКоличестваУпаковок = ВыборкаДетальныеЗаписи.КоличествоУпаковок / ?(ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.КоличествоУпаковокСпецификации),ВыборкаДетальныеЗаписи.КоличествоУпаковокСпецификации, 1);
			ДлительностьСпецификацииСКратностьюВСекундах = (ОбщегоНазначенияУТКлиентСервер.ВремяВСекундах(ВыборкаДетальныеЗаписи.ЭтапДлительностьЭтапа, ВыборкаДетальныеЗаписи.ЭтапЕдиницаИзмеренияДлительностиЭтапа) * КратностьКоличестваУпаковок);
			РасчетноеВремяЗавершенияЭтапа = ОбщегоНазначенияУТКлиентСервер.ДобавитьКДатеВремя(ДатаОтсечения, ДлительностьСпецификацииСКратностьюВСекундах, Перечисления.ЕдиницыИзмеренияВремени.Секунда);
			РазностьДат = Цел(((РасчетноеВремяЗавершенияЭтапа + 86400) - ВыборкаДетальныеЗаписи.ДатаВыпуска)/86400);
			Если РазностьДат > 0 Тогда
				ТекстОшибки = СтрШаблон(ШаблонОшибки, ВыборкаДетальныеЗаписи.Номенклатура, ВыборкаДетальныеЗаписи.КоличествоУпаковок, РазностьДат);
				ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
